0.1.0/tutorials/heat-transfer/buoyant-pimple/hot_room/system/blockMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 1;
vertices
(
  (0 0 0)
  (10 0 0)
  (10 5 0)
  (0 5 0)
  (0 0 10)
  (10 0 10)
  (10 5 10)
  (0 5 10)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (20 10 20) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
  floor
  {
    type wall;
    faces
    (
      (1 5 4 0)
    );
  }
  ceiling
  {
    type wall;
    faces
    (
      (3 7 6 2)
    );
  }
  fixedWalls
  {
    type wall;
    faces
    (
      (0 4 7 3)
      (2 6 5 1)
      (0 3 2 1)
      (4 5 6 7)
    );
  }
);
mergePatchPairs
(
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
