0.1.0/tutorials/heat-transfer/buoyant-pimple/hot_room/0.org/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 1e5;

boundaryField
{
  floor
  {
    type            calculated;
    value           $internalField;
  }
  ceiling
  {
    type            calculated;
    value           $internalField;
  }
  fixedWalls
  {
    type            calculated;
    value           $internalField;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
