0.1.0/tutorials/heat-transfer/buoyant-pimple/hot_room/0.org/T
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;

boundaryField
{
  floor
  {
    type            fixedValue;
    value           uniform 300;
  }
  ceiling
  {
    type            fixedValue;
    value           uniform 300;
  }
  fixedWalls
  {
    type            zeroGradient;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
