0.1.0/tutorials/heat-transfer/buoyant-pimple/hot_room/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         Euler;
}
gradSchemes
{
  default         Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      Gauss upwind;
  div(phi,h)      Gauss upwind;
  div(phi,e)      Gauss upwind;
  div(phi,k)      Gauss upwind;
  div(phi,epsilon) Gauss upwind;
  div(phi,R)      Gauss upwind;
  div(phi,K)      Gauss linear;
  div(phi,Ekp)    Gauss linear;
  div(R)          Gauss linear;
  div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear corrected;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         corrected;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
